openssl/stats/jre9/java9-producer-openssl-500k.txt
1935 records sent, 386.6 records/sec (188.78 MB/sec), 163.3 ms avg latency, 269.0 max latency.
2623 records sent, 524.5 records/sec (256.10 MB/sec), 125.8 ms avg latency, 179.0 max latency.
2525 records sent, 504.9 records/sec (246.53 MB/sec), 130.4 ms avg latency, 165.0 max latency.
2788 records sent, 557.5 records/sec (272.21 MB/sec), 118.4 ms avg latency, 156.0 max latency.
10000 records sent, 494.071146 records/sec (241.25 MB/sec), 132.03 ms avg latency, 269.00 ms max latency, 122 ms 50th, 193 ms 95th, 228 ms 99th, 249 ms 99.9th.